#include <stdio.h>
/*
定义一个double a[3][4];
(1)打印第一维数组每个元素的起始地址
(2)打印第二维数组每个元素的起始地址
(3)打印第一维数组的地址地址
(4)从键盘输入数组，输出每个元素的内容
(5)计算数组的大小，并输出




   */

int main()
{
		int a[4][2]={1,2,3,4,5,6,7,8};
        int i,j;
		printf("第一维数组每个元素的起始地址：\n");
		
		for(i=0;i<4;i++)
		{
				printf("&a[%d]=%p\n",i,&a[i]);
		}

		printf("\n===========================================\n");
		for(i=0;i<4;i++)
		{
				printf("a+%d =%p\n",i,a+i);
		}


		printf("第二维数组每个元素的起始地址:\n");

		for(i=0;i<4;i++)
		{
				for(j=0;j<2;j++)
				{
					printf("&a[%d][%d]=%p\t",i,j,&a[i][j]);
				}
				printf("\n");
		}

		printf("\n===========================================\n");

		for(i=0;i<4;i++)
		{
				for(j=0;j<2;j++)
				{
						printf("a[%d]+%d=%p\t",i,j,a[i]+j);
				}
				printf("\n");
		}


        printf("第一维数组的起始地址：");
		printf("&a = %p,&a+1=%p\n",&a,&a+1);
		return 0;
}

